tests/Moneybird.Net.Tests/Responses/Endpoints/SalesInvoices/postSalesInvoice.json

{
  "id": "370131045846090915",
  "administration_id": "281289699686381606",
  "contact_id": "370131045504255127",
  "contact": {
    "id": "370131045504255127",
    "administration_id": "281289699686381606",
    "company_name": "Foobar Holding B.V.",
    "firstname": "",
    "lastname": "",
    "address1": "Hoofdstraat 12",
    "address2": "",
    "zipcode": "1234AB",
    "city": "Amsterdam",
    "country": "NL",
    "phone": "",
    "delivery_method": "Email",
    "customer_id": "1",
    "tax_number": "",
    "chamber_of_commerce": "",
    "bank_account": "",
    "attention": "",
    "email": "info@example.com",
    "email_ubl": true,
    "send_invoices_to_attention": "",
    "send_invoices_to_email": "info@example.com",
    "send_estimates_to_attention": "",
    "send_estimates_to_email": "info@example.com",
    "sepa_active": false,
    "sepa_iban": "",
    "sepa_iban_account_name": "",
    "sepa_bic": "",
    "sepa_mandate_id": "",
    "sepa_mandate_date": null,
    "sepa_sequence_type": "RCUR",
    "credit_card_number": "",
    "credit_card_reference": "",
    "credit_card_type": null,
    "tax_number_validated_at": null,
    "tax_number_valid": null,
    "invoice_workflow_id": null,
    "estimate_workflow_id": null,
    "si_identifier": "",
    "si_identifier_type": null,
    "moneybird_payments_mandate": false,
    "created_at": "2022-10-31T08:21:33.522Z",
    "updated_at": "2022-10-31T08:21:33.522Z",
    "version": 1667204493,
    "sales_invoices_url": "http://moneybird.dev/123/sales_invoices/b214cf981113c1b00fa5f6892115eccc4a45c0db6c3ddc42eddc2cac2f2ac8a5/all",
    "notes": [

    ],
    "custom_fields": [

    ],
    "contact_people": [
      {
        "id": "370131045521032346",
        "administration_id": "281289699686381606",
        "firstname": "Jan",
        "lastname": "Janssen",
        "phone": "123-456-2346",
        "email": "janjanssen@dev.null.moneybird.net",
        "department": "Sales",
        "created_at": "2022-10-31T08:21:33.537Z",
        "updated_at": "2022-10-31T08:21:33.537Z",
        "version": 1667204493
      }
    ]
  },
  "contact_person_id": null,
  "contact_person": null,
  "invoice_id": null,
  "recurring_sales_invoice_id": null,
  "workflow_id": "370130885386700608",
  "document_style_id": "370130885545035594",
  "identity_id": "370130885233608511",
  "draft_id": 2,
  "state": "draft",
  "invoice_date": null,
  "due_date": "2022-11-14",
  "payment_conditions": "We verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price} voor {document.due_date} te voldoen op onze bankrekening onder vermelding van de omschrijving {document.payment_reference}. Voor vragen kunt u contact opnemen per e-mail.",
  "payment_reference": null,
  "short_payment_reference": null,
  "reference": "30052",
  "language": "nl",
  "currency": "USD",
  "discount": "0.0",
  "original_sales_invoice_id": null,
  "paused": false,
  "paid_at": null,
  "sent_at": null,
  "created_at": "2022-10-31T08:21:33.848Z",
  "updated_at": "2022-10-31T08:21:33.852Z",
  "public_view_code": null,
  "public_view_code_expires_at": null,
  "version": 1667204493,
  "details": [
    {
      "id": "370131045848188068",
      "administration_id": "281289699686381606",
      "tax_rate_id": "370131045760107682",
      "ledger_account_id": "370130885125605157",
      "project_id": null,
      "product_id": null,
      "amount": null,
      "amount_decimal": "1.0",
      "description": "Rocking Chair",
      "price": "159.99",
      "period": null,
      "row_order": 0,
      "total_price_excl_tax_with_discount": "159.99",
      "total_price_excl_tax_with_discount_base": "127.99",
      "tax_report_reference": [
        "NL/3a"
      ],
      "mandatory_tax_text": null,
      "created_at": "2022-10-31T08:21:33.850Z",
      "updated_at": "2022-10-31T08:21:33.850Z"
    }
  ],
  "payments": [

  ],
  "total_paid": "0.0",
  "total_unpaid": "159.99",
  "total_unpaid_base": "127.99",
  "prices_are_incl_tax": false,
  "total_price_excl_tax": "159.99",
  "total_price_excl_tax_base": "127.99",
  "total_price_incl_tax": "159.99",
  "total_price_incl_tax_base": "127.99",
  "total_discount": "0.0",
  "marked_dubious_on": null,
  "marked_uncollectible_on": null,
  "reminder_count": 0,
  "next_reminder": null,
  "original_estimate_id": null,
  "url": "http://moneybird.dev/123/sales_invoices/2a1b978e807a6a92948c355c6c0d04e1709e45c1f900c1cc94579b7efab1dcef/b214cf981113c1b00fa5f6892115eccc4a45c0db6c3ddc42eddc2cac2f2ac8a5",
  "payment_url": "http://moneybird.dev/123/online_sales_invoices/2a1b978e807a6a92948c355c6c0d04e1709e45c1f900c1cc94579b7efab1dcef/b214cf981113c1b00fa5f6892115eccc4a45c0db6c3ddc42eddc2cac2f2ac8a5/pay_invoice",
  "custom_fields": [

  ],
  "notes": [

  ],
  "attachments": [

  ],
  "events": [
    {
      "administration_id": "281289699686381606",
      "user_id": 16672043409172,
      "action": "sales_invoice_created",
      "link_entity_id": null,
      "link_entity_type": null,
      "data": {
      },
      "created_at": "2022-10-31T08:21:33.854Z",
      "updated_at": "2022-10-31T08:21:33.854Z"
    }
  ],
  "tax_totals": [

  ]
}
